----------------------------------SWITCH_S1----------------------------------

Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname SwitchS1
SwitchS1(config)#vlan 10
SwitchS1(config-vlan)#name vlan10
SwitchS1(config-vlan)#exit
SwitchS1(config)#vlan 20
SwitchS1(config-vlan)#name vlan20
SwitchS1(config-vlan)#exit 
SwitchS1(config)#exit
SwitchS1#
%SYS-5-CONFIG_I: Configured from console by console

SwitchS1#wr
Building configuration...
[OK]
SwitchS1#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
SwitchS1(config)#interface range fa0/1-10
SwitchS1(config-if-range)#switchport mode access
SwitchS1(config-if-range)#switchport access vlan 10
SwitchS1(config-if-range)#exit
SwitchS1(config)#interface range fa0/11-20
SwitchS1(config-if-range)#switchport mode access
SwitchS1(config-if-range)#switchport access vlan 20
SwitchS1(config-if-range)#exit
SwitchS1(config)#interface g0/1
SwitchS1(config-if)#switchport mode trunk

SwitchS1(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface GigabitEthernet0/1, changed state to up

SwitchS1(config-if)#switchport trunk allowed vlan 10,20
SwitchS1(config-if)#exit
SwitchS1(config)#exit
SwitchS1#
%SYS-5-CONFIG_I: Configured from console by console

SwitchS1#wr
Building configuration...
[OK]
SwitchS1#


----------------------------------SWITCH_S2----------------------------------
Switch>ena
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#hostname Switch_S2
Switch_S2(config)#vlan 10
Switch_S2(config-vlan)#name vlan10
Switch_S2(config-vlan)#exit
Switch_S2(config)#vlan 20
Switch_S2(config-vlan)#name vlan20
Switch_S2(config-vlan)#exit
Switch_S2(config)#interface range fa0/1-10
Switch_S2(config-if-range)#switchport mode access
Switch_S2(config-if-range)#switchport access vlan 10
Switch_S2(config-if-range)#exit
Switch_S2(config)#interface range fa0/10-20
Switch_S2(config-if-range)#switchport mode access
Switch_S2(config-if-range)#switchport access vlan 20
Switch_S2(config-if-range)#exit
Switch_S2(config)#interface g0/1
Switch_S2(config-if)#switchport mode trunk
Switch_S2(config-if)#switchport trunk allowed vlan 10,20
Switch_S2(config-if)#exit
Switch_S2(config)#exit
Switch_S2#
%SYS-5-CONFIG_I: Configured from console by console

Switch_S2#wr
Building configuration...
[OK]
Switch_S2#